{"backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"config": {"batch_input_shape": [null, 160, 320, 3], "dtype": "float32", "function_type": "lambda", "output_shape_type": "raw", "arguments": {}, "name": "lambda_1", "function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwwAAAB8AABkAQAbZAIAGFMpA07nAAAAAADgX0DnAAAAAAAA\n8D+pACkB2gF4cgMAAAByAwAAAPoIbW9kZWwucHnaCDxsYW1iZGE+wAAAAHMAAAAA\n", null, null], "trainable": true, "output_shape": null}, "class_name": "Lambda"}, {"config": {"data_format": "channels_last", "name": "cropping2d_1", "cropping": [[50, 20], [0, 0]], "trainable": true}, "class_name": "Cropping2D"}, {"config": {"bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "strides": [4, 4], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "conv2d_1", "kernel_size": [8, 8], "padding": "same", "data_format": "channels_last", "use_bias": true, "filters": 32, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "strides": [4, 4], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "conv2d_2", "kernel_size": [8, 8], "padding": "same", "data_format": "channels_last", "use_bias": true, "filters": 64, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "strides": [2, 2], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "conv2d_3", "kernel_size": [4, 4], "padding": "same", "data_format": "channels_last", "use_bias": true, "filters": 128, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "conv2d_4", "kernel_size": [2, 2], "padding": "same", "data_format": "channels_last", "use_bias": true, "filters": 128, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"seed": null, "trainable": true, "name": "dropout_1", "noise_shape": null, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "dense_1", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "trainable": true, "units": 128, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "class_name": "Activation"}, {"config": {"seed": null, "trainable": true, "name": "dropout_2", "noise_shape": null, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "dense_2", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "trainable": true, "units": 128, "activation": "linear"}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "dense_3", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "trainable": true, "units": 1, "activation": "linear"}, "class_name": "Dense"}]}, "keras_version": "2.2.4", "class_name": "Sequential"}